{
    "identity": "email",
    "protectedData": {
        "users": {
            "35c62d76-8152-4626-8712-eeb96381bea8": {
                "email": "peter@abv.bg",
                "firstName": "Peter",
                "lastName": "Petrov",
                "hashedPassword": "83313014ed3e2391aa1332615d2f053cf5c1bfe05ca1cbcb5582443822df6eb1"
            },
            "555e7df7-a8b7-4391-b468-1a891f766202": {
                "email": "simona@gmail.com",
                "firstName": "Симона",
                "lastName": "Иванова",
                "hashedPassword": "83313014ed3e2391aa1332615d2f053cf5c1bfe05ca1cbcb5582443822df6eb1"
            }
        },
        "sessions": {}
    },
    "seedData": {
        "recipes": {
            "7a58a937-a2d0-4a54-aecb-455704a1624f": {
                "_ownerId": "555e7df7-a8b7-4391-b468-1a891f766202",
                "title": "Празнична питка",
                "category": "Хляб",
                "imageUrl1": "https://3.bp.blogspot.com/-MxE3NmxKF6Q/Vtg32TkdbzI/AAAAAAAAJtI/hlIbjqp8t5w/s1600/DSC_4613.JPG",
                "imageUrl2": "https://2.bp.blogspot.com/-O9dpyj2FmUA/Vtg1ge9civI/AAAAAAAAJs8/UEXWiTH2BuI/s1600/DSC_4623.JPG",
                "prepTime": "20",
                "cookingTime": "60",
                "serving": "8",
                "ingredients": "260 милилитра прясно млякo\n7 грама суха мая\n2 супени лъжици захар\n80 грама масло, разтопено и охладено\n1 яйце и 1 белтък (жълтъка отделете за намазване на питката преди печене)\n1 чаена лъжичка прясно мляко за смесване с жълтъка 500 грама бяло брашно тип 650\n1 и ¼ чаени лъжички сол\nчерен и бял сусам за поръсване, по желание",
                "steps": "Намажете тава подходяща за печене с масло и я оставете настрана, докато ви потрябва.В малка купа смесете топлото мляко с 2 супени лъжици захар и 7 грама суха мая. Разбъркайте добре, докато маята се разтвори. Покрийте купата с кърпа и оставете сместа на топло място в продължение на 20 минути.\nРазтопете маслото и го оставете да се охлади. Разбйте яйцата с вилица. Прибавете охладеното масло и разбитите яйца към активираната мая, разбъркайте. Пресейте брашното и прибавете към него солта, разбъркайте и направете кладенче по средата. Изсипете в кладенчето смесените мляко, мая, масло и яйца. Разбъркайте всичко с дървена лъжица, докато се смеси добре.\nПоръсете плота с брашно и изсипете тестото. Омесете, докато получите меко, еластично и нелепнещо тесто.\nПоставете тестото в чиста купа и я покрийте с найлоново фолио. Оставете тестото да втасва за един час в топло помещение.\nСлед втасването на тестото го поставете върху поръсен с малко брашно плот, омесете за кратко и оформете питката, както ви харесва.\nОставете оформената питка да втасва за 40 минути.\nПреди да изпечете питката намажете повърхността с разбит жълтък с една чаена лъжичка прясно мляко.\nПоставете питката в студена фурна и включете на 200⁰С. Печете на тази температура 10 минути, след което намалете температурата на 180⁰С.\n",
                "_createdOn": 1680788509024
            },
            "7a58a937-a2d0-4a54-aecb-455704a16245": {
                "_ownerId": "555e7df7-a8b7-4391-b468-1a891f766202",
                "title": "Цветна салата с леща",
                "category": "Салати",
                "imageUrl1": "https://donevatania.com/wp-content/uploads/2021/03/DSC4560.jpg",
                "imageUrl2": "https://1.bp.blogspot.com/-6_hDG4fNjU0/YF21S3IdOXI/AAAAAAAAYXI/zg_2T_RxVU0gpZk2QRmerjjTwtCRu4d2ACLcBGAsYHQ/w649-h931/_DSC4570.jpg",
                "prepTime": "15",
                "cookingTime": "120",
                "serving": "4",
                "ingredients": "250 г. кафява леща, можете да използвате и Белуга\n2 портокала\n2 парчета цвекло предварително сварени\n1 нар\n100 г. меко козе сирене\n1 лук шалот\n1 връзка мента\n½ връзка магданоз",
                "steps": "Измийте цвеклото, завийте го в алуминиево фолио и го изпечете за 1 и ½ часа във фурната.\nИзмийте ментата и магданоза и ги оставете настрани да се отцедят.\nПоставете вода в касерола. След като заври, изсипете лещата в нея и варете за 20-25 минути на ниска температура, докато омекне, не прекалявайте с варенето. Изсипете в голяма цедка сварената леща, залейте със студена вода, за да спре варенето и отцедете много добре.\nСмесете сиренето със ситно нарязана мента и магданоз и оформете малки трюфели с ръце. Ако нямате меко козе сирене, можете да намачкате твърдо и да прибавите 1-2 чаени лъжички крема сирене, за да можете да оформите трюфелите. Оваляйте трюфелите в едро смлени ядки шам фъстък.\nМеждувременно обелете портокалите и ги нарежете на филийки (можете да замените портокалите с обикновени или да изпозвате пресни праскови или райска ябълка, според сезона, в който се намираме). Обелете и нарежете на филийки изпеченото цвекло и наронете зъната нар. Нарежете лука на полумесеци.\nЗа дресинга, нарежете чесъна на ситно и сложете всички съставки в ръчния чопър за смесване. С няколко движения ще получите най-съвършения дресинг.\nПодредете в голямо плато всички съставки за салатата и полейте с дресинга. Поръсете салатата със семената от нар и гарнирайте с прясна мента и трюфелите от козе сирене.\nСъс салатата можете да поднесете малки пуккави питки или препечени филийки, както предпочитате.\nЗа да приготвя моята салата, използвах тези два уреда, които също можете да намерите в каталога на Метро. Уверявам ви, че са абсолютно невероятни и имат място в кухнята на всяко домакинство! Аз съм влюбена в тях, защото се използват лесно, лесно се почистват и вършат прекрасно всичко, за което са предназначени. Например ръчния чопър за зеленчуци, използвам вече няколко пъти за смесване на дресинги, както и за разбиване на белтъци, а в нарязването е първенец само с няколко движения.",
                "_createdOn": 1680788509024
            },
            "9a58a937-a2d0-4a54-aecb-455704a16247": {
                "_ownerId": "555e7df7-a8b7-4391-b468-1a891f766202",
                "title": "Бутер кифлички със сладко от ягоди",
                "category": "Закуски",
                "imageUrl1": "https://donevatania.com/wp-content/uploads/2022/06/DSC40861.jpg",
                "imageUrl2": "https://donevatania.com/wp-content/uploads/2022/06/DSC409811.jpg",
                "prepTime": "10",
                "cookingTime": "30",
                "serving": "4",
                "ingredients": "сладко от ягоди\n1 бр. охладено бутер тесто\n8 ч. л. сладко от ягоди\n1 бр. жълтък + 1 ч. л. прясно мляко, за намазване на кифличките преди печене\nпудра запар за поръсване преди сервиране",
                "steps": "Включете фурната да загрява на 190°С.\nРазтворете бутер тестото върху работния плот.\nНарежете го на 8 квадрата. Разточете ги леко в правоъгълна форма върху леко набрашнена повърхност. Всяко парче, нарежете до половината на ленти по дължина. Поставете една чаена лъжичка от сладкото и го разпределете добре на другата половина от тестото. Навийте на руло откъм сладкото и оформете като кифличка.\nПоставете ги така оформените върху тава постлана с хартия за печене. Намажете кифличките с разбития жълтък с прясно мляко и печете за 30-35 минути, докато станат златисто-кафяви.\nПоръсете кифличките с пудра захар и ги сервирайте, докато са още топли.",
                "_createdOn": 1680788509024
            },
            "4a58a937-a2d0-4a54-aecb-455704a16246": {
                "_ownerId": "555e7df7-a8b7-4391-b468-1a891f766202",
                "title": "Капрезе с тиквички на грил",
                "category": "Салати",
                "imageUrl1": "https://donevatania.com/wp-content/uploads/2016/05/38.jpg",
                "imageUrl2": "https://2.bp.blogspot.com/-B17PfNpTRQE/VyzgVOyyLuI/AAAAAAAAKhI/ycBCnvyKRh8ZR1LChVenFqXUuqzu2MKhgCLcB/s1600/39.jpg",
                "prepTime": "15",
                "cookingTime": "20",
                "serving": "4",
                "ingredients": "3 млади тиквички\n2 домата\n2 топчета моцарела\nсолчерен пипер, зехтин, оцет балсамико\nпесто",
                "steps": "Измийте и нарежете тиквичкити по дължина на филии. \nОвкусете ги със сол, черен пипер и зехтин и ги изпечете на грил или на грил тиган, докато се зачервят добре и омекнат. Поставете тиквичките върху чиния за сервиране.\n Нарежете доматите и моцарелата на кръгчета и ги подредете върху тиквичките. Поръсете със сол и гарнирайте с песто.\n Разбъркайте 1 супена лъжица оцет балсамико с две супени лъжици зехтин и овкусете салатата с дресинга.",
                "_createdOn": 1680788509024
            },
            "2a58a937-a2d0-4a54-aecb-455704a16249": {
                "_ownerId": "555e7df7-a8b7-4391-b468-1a891f766202",
                "title": "Мини чийзкейк с малини",
                "category": "Десерти",
                "imageUrl1": "https://donevatania.com/wp-content/uploads/2022/06/DSC42721.jpg",
                "imageUrl2": "https://donevatania.com/wp-content/uploads/2022/06/DSC430711.jpg",
                "prepTime": "10",
                "cookingTime": "30",
                "serving": "6",
                "ingredients": "120 г ор\n75 г овесени ядки\n100 г меки фурми без костилка\n2-3 супени лъжици вода, за получаване на леко лепкава консистенц\n200 г сурови ядки кашу, накиснати, след това изплакнати и отцедени\n100 г сурови орехови ядки, накиснати, след това изплакнати и отцедени\n200 мл пълномаслено кокосово мляко (само твърдата част от кокосово мляко в консерва)\n90 г кокосова захар ПАСИФЛОРА + 2 супени лъжици сироп от агаве или кленов сироп\n30 мл лимонов сок + кората от един лимон\n1 чаена лъжица екстракт от ванилия, по желание \n120 г малини, пресни или\n3-4 супени лъжици кокосова захар\n¼ чаена лъжица агар агар",
                "steps": "Намаслете леко тавичка за мъфини с 12 чаши. Нарежете ленти пергаментова хартия и ги поставете във всяка чашка по дъното и със стърчащи краища, така ще можете да извадите чийзкейка безпроблемно.\nПоставете орехите, овесените ядки и фурмите в кухненски робот или блендер и смелете, докато се образува груба, леко лепкава смес. Прибавете водата и смелете отново. Разделете сместа на 10-12 равни части и притиснете всяка във формичките за мъфини, за да покрият дъното. Направете го с пръсти, чаша или чаена лъжичка.\nПоставете накиснатите кашу и орехи, кокосовото мляко, кокосовата захар, сиропа от агаве, лимоновия сок и екстракта от ванилия (ако използвате) в блендер и разбийте до гладка и кремообразна смес. Изсипете сместа върху основата на мини чийзкейка. Почукайте няколко пъти формата от плота, за да освободите въздушните мехурчета, след което поставете във фризера за 20 минути, за да стегне крема. \nПоставете малините в касерола и ги сварете с кокосовата захар за няколко минути, докато омекнат и пуснат соковете си. \nМахнете от огъня и прецедете малините от семената. Добавете агар агар и върнете на слаб огън за 1 минута, като бъркате непрекъснато. \nИзсипете желето най-отгоре върху чийзкейка. \nЗамразете мини чийзкейка за поне 2 часа докато стегнат. \nСлед като са замразени, извадете ги, като издърпате внимателно пергаментовата хартия. Оставете да се размразят за 10 минути преди сервиране.",
                "_createdOn": 1680788509024
            },
            "5a58a937-a2d0-4a54-aecb-455704a16248": {
                "_ownerId": "555e7df7-a8b7-4391-b468-1a891f766202",
                "title": "Портокалов тарт без печене",
                "category": "Десерти",
                "imageUrl1": "https://donevatania.com/wp-content/uploads/2022/02/DSC0324-21.jpg",
                "imageUrl2": "https://images.unsplash.com/photo-1560607162-26b0344e6943?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MTh8fG9yYW5nZSUyMGZydWl0fGVufDB8fDB8fA%3D%3D&auto=format&fit=crop&w=600&q=60",
                "prepTime": "20",
                "cookingTime": "35",
                "serving": "8",
                "ingredients": "\n¼ ч. ч. лешници смлени на брашно\n½ ч. ч. белени бадеми смлени на брашно\n½ ч. ч. кокосови стърготини\n2 с. л. каако\n½ ч. ч. овесени ядки, смлени на брашно\n6 бр. фурми ако са твърди, накиснете ги в хладка вода, за даомекнат\n½ от настъргана кора на портокал\n2 с. л. сок от портокал\n¼ ч. ч. кокосово масло\n2 с. л. сироп от фурми\n400 мл. кокосово мляко, пълномасленно\n⅓ ч. ч. кокосова сметана може да използвате само гъстата част на кокосово мляко от консерва\n1 ч. ч. (250 мл.) портокалов сок от червени портокали с пулпата (може да използвате и обикновени)\n½ ч. л. куркума за цвят (ако искате да засилите цвета, сложете повече)\n1 с. л. царевично нишесте\n1 ч. л. лимонов сок\n60 мл. кленов сироп (опитайте и добавете още малко, ако ви се стори не достатъчно сладко)\n1 ч. л ванилов екстракт\n1 с. л. мед\n½ ч. л агар-агар",
                "steps": "Смесете всички продукти за блата и ги разбъркайте много добре. \nПоставете ринг за оформяне на торти с диаметър 20-22 см. директно върху чиния за сервиране. Намажете стените на ринга отвътре с кокосово масло и поставете ацетатно фолио. Разпределете сместа за блата по дъното равномерно и притиснете с лъжица. \nПриберете така оформения блат приберете във фризера, докато приготвите крема. \nЗа да приготвите крема, поставете всички изброени продукти в касерола на ниска температура. Загрейте и бъркайте, докато сместа стане равномерно гладка и започне леко да се уплътнява. Не трябва да я варите дълго. \nОставете крема да се охлади за 10 минути и го изсипете върху блата. \nПремахнете с клечка за зъби балончетата по повърхността и приберете тортата във фризера за 1 час, докато стегне крема. \nПреди да сервирате, декорирайте тортата с резени червен портокал.",
                "_createdOn": 1680788509024
            },
            "8a77a937-a2d0-4a54-aecb-488704a16249": {
                "_ownerId": "555e7df7-a8b7-4391-b468-1a891f766202",
                "title": "Палачинки с тиквички и сирене рикота",
                "category": "Предястия",
                "imageUrl1": "https://donevatania.com/wp-content/uploads/2021/03/%D0%9F%D0%B0%D0%BB%D0%B0%D1%87%D0%B8%D0%BD%D0%BA%D0%B8-%D1%81-%D1%82%D0%B8%D0%BA%D0%B2%D0%B8%D1%87%D0%BA%D0%B8-%D0%B8-%D1%81%D0%B8%D1%80%D0%B5%D0%BD%D0%B5-%D1%80%D0%B8%D0%BA%D0%BE%D1%82%D0%B0-2.jpg",
                "imageUrl2": "https://sofiamel.bg/uploads/recipes/recipe/image/PwOvfIJLy1.jpg",
                "prepTime": "15",
                "cookingTime": "35",
                "serving": "6",
                "ingredients": "180 г брашно София Мел Типов\n50 г масло, разтопено и охладено\n400 мл прясно мляко\n4 яйце\n¼ ч.л. сода бикарбонат\n½ ч.л. со\nчерен пипер\nзехтин за пържене\n1 голяма глава лук\n2 скилидки чесън\n800 г тиквички\n250 г сирене рикота\n150 г крема сирене\n⅓ ч.л. индийско орехче\n2 стръка див лук\n2 стръка копър\nкората от ½ лимон\nсол\nчерен пипер\nзехтин за запържване\n50 г прясно настърган пармезан",
                "steps": "Всички продукти за тестото, поставете в удобна купа и ги разбийте с миксер до гладка, еднородна консистенция. Покрийте тестото и го оставете да почива за около 30 минути, докато приготвите плънката. Обелете лука и чесъна и ги нарежете ситно. Махнете крайчетата на тиквичките, и ги настържете на едрото ренде. Отцедете ги през тензух от водата. \nВ удобен тиган за пържене, поставете 2 лъжички зехтин и задушете лука и чесъна за 1-2 минути на средна топлина. След това прибавете тиквичките и гответе на по-силна топлина за около 5 минути. Подправете със сол, черен пипер, индийско орехче и лимоновите кори. Готовите тиквички оставете да изстинат, преди да ги смесите с останалите продукти. \nРазбъркайте сиренето рикота с крема сиренето, нарязания див лук и копъра. Смесете сирената с тиквичките и разбъркайте добре. В голям тиган за палачинки или друг удобен за пържене, поставете ½ чаена лъжичка зехтин и го загрейте на средно-висока температура. Изпържете палачинките в него. Ако тигана ви е голям, ще получите 6-7 броя палачинки, ако е по-малък, съответно повече. \nСлед като палачинките са готови и охладени, намажете ги обилно с плънката от тиквички, рикота и крема сирене, като внимавате да има по равно за всички. Поставете ги в удобна тавичка за печене и настържете върху тях пармезана. \nЗапечете палачинките в предварително загрята фурна на 180⁰С за 30 минути.",
                "_createdOn": 1680788509024
            },
            "5677a937-a2d0-4a54-aecb-488734a16249": {
                "_ownerId": "555e7df7-a8b7-4391-b468-1a891f766202",
                "title": "Фалафели от зрял боб, нахут и печена тиква",
                "category": "Основни ястия",
                "imageUrl1": "https://2.bp.blogspot.com/-qykVosu0kkk/W7PJya30TgI/AAAAAAAAQSo/pIKMDUVzyQEb4BZHuC8IutCf77d8W3X1gCLcBGAs/s1600/DSC_09344.jpg",
                "imageUrl2": "https://1.bp.blogspot.com/-5drPY4M8gus/W7PEnLBL5ZI/AAAAAAAAQSY/nKwtdMAQpqsp863-mvk5LUxibIW-rQ1YACLcBGAs/s1600/DSC_09301.jpg",
                "prepTime": "20",
                "cookingTime": "30",
                "serving": "4",
                "ingredients": "300 грама Зрял боб консерва Bonduelle\n150 грама нахут от консерва\n250 грама печена тиква\n½ връзка магданоз\n½ глава лук\n2 скилидки чесън\n1 яйце\n2 супени лъжици оризово брашно\n½ чаена лъжичка кимион\n½ чаена лъжичка пушен червен пипер\nСол и черен пипер\nЗехтин за пържене",
                "steps": "Отцедете много добре боба и нахута от водата. Поставете всички продукти в кухненски чопър и смелете, докато получите еднородна смес. Опитайте и прибавете още сол и пипер, ако е необходимо.\nЗагрейте на среден огън три супени лъжици зехтин в голям тиган с незалепващо покритие. Поставете на няколко места в тигана по една пълна супена лъжица от сместа  и оформете леко. Изпържете до златисто-кафяво, обърнете и от другата страна. Пригответе по този начин до изчерпване на количеството.\nЗа да гарнирате сандвичите, пригответе и ситно нарязана салата от чери домати, авокадо, краставица и сладка царевица на зърна Bonduelle. Овкусете със зехтин, бял балсамов оцет, сол и черен пипер.\nПригответе също сос от кисело мляко и чесън, ако обичате.\nПоставете по две три супени лъжици от свежата салата в леко затопен арабски хляб върху незалепващ тиган и прибавете от кюфтетата.",
                "_createdOn": 1680788509024
            },
            "8887a937-a2d0-4a54-aecb-488734a16249": {
                "_ownerId": "555e7df7-a8b7-4391-b468-1a891f766202",
                "title": "Баклава Чийзкейк с малини",
                "category": "Десерти",
                "imageUrl1": "https://donevatania.com/wp-content/uploads/2022/11/DSC65371.jpg",
                "imageUrl2": " https://donevatania.com/wp-content/uploads/2022/11/DSC657311-768x1152.jpg",
                "prepTime": "30",
                "cookingTime": "80",
                "serving": "8",
                "ingredients": "600 г крема сирене, на стайна температура\n200 г захар\n3 с. л. мед Истински мед\n2 бр. големи яйца\n1 пак. Специален пудинг за бисквитена торта Ванилия Dr.Oetker\n90 г гъсто кисело мляко\n1 ч. л. екстракт от ванилия Dr.Oetker\n1 ч. л. розова вода\n200 г пресни малини\n16 бр. фини кори за баница\n150 г суров обелен шамфъстък\n100 г разтопено краве масло\n200 мл. вода\n100 г Истински мед\n½ бр. лимон, сока\n1 бр. пръчка канела\n1 бр. шушулка ванилия\n1 ½ ч. л. розова вода",
                "steps": "Загрейте фурната до 160°C. Поставете хартия за печене в кръгла форма с подвижен ринг, с диаметър 24 см.\nВ голяма купа поставете мекото крема сирене със захарта. След това добавете яйцата и киселото мляко. Прибавете пудинга, екстракта от ванилия и розовата вода. Разбъркайте, докато получите гладка кремообразна смес. Оставете пълнежа настрана, докато приготвите основата.\nЗапечете върху сух тиган за 2-3 минути суровите шамфъстъци, като ги разбърквате често.Свалете ги от котлона и ги преместете в друг съд, за да се охладят. Нарежете ги на дребни парчета.Внимателно поставете една кора за баница във формата, която сте избрали за печенето на чийзкейка. Намажете леко с масло. Добавете още една кора отгоре. Намажете отново с масло. Редувайте по същия начин до петата кора. Върху нея поръсете равномерно една трета от нарязаните ядки.Покрийте ядките със следващите пет листа, като намазвате леко с масло всяка кора. Отгоре поръсете още една четвърт от ядките. Повторете този процес още веднъж и завършете с една кора.Изрежете висящите кори от формата.\nТака подготвената основа за чийзкейка, изпечете на сляпо, като поставите върху корите хартия за печене и тежест (аз използвам стар боб) по същия начин, както печете основа за тарт от маслено тесто. Изпечете за 30 минути.\nСлед това извадете основата от фурната и премахнете хартията за печене с тежестта.Изсипете половината от пълнежа за чийзкейка и разпределете половината от малините.Изсипете и останалата смес и подредете останалите малини по повърхността.\nПечете в предварително загрята фурна за 70-80 минути на 160°C или докато крема стегне, но все още е леко мек по средата.  Моят десерт се пече 75 минути.Изключете фурната и оставете чийзкейка в нея за 15-20 минути при леко открехната врата.\nДокато чийзкейка се пече, пригответе сиропа, като кипнете водата с меда, пръчката канела, лимоновия сок, ваниловата шушулка и меда. След като заври, намалете котлона и оставете да къкри на ниска температура за около 5 минути.Сиропа трябва да се сгъсти леко.Извадете пръчката канела и ванилията, и оставете сиропа да се охлади. Добавете лимоновия сок и розовата вода.\nИзвадете чийзкейка от фурната и много внимателно отстранете ринга на формата. С помощта на четка, намажете обилно краищата на чийзкейка със сиропа, докато е още горещ. Най-важно е сиропа да се разпредели върху изпечените кори.Ако ви остане от сиропа, полейте и чийзкейка.\nОставете десерта да престои на стайна температура за 2-3 часа, след което го охладете за една нощ в хладилника.Гарнирайте с нарязан шамфъстък и пресни малини.",
                "_createdOn": 1680788509024
            },
            "9997a937-a2d0-4a54-aecb-488734a16249": {
                "_ownerId": "555e7df7-a8b7-4391-b468-1a891f766202",
                "title": "Портокалови Каноли",
                "category": "Десерти",
                "imageUrl1": "https://donevatania.com/wp-content/uploads/2021/03/DSC3877.jpg",
                "imageUrl2": "https://1.bp.blogspot.com/-bSUeUVXoj20/YEO9Ga3WdYI/AAAAAAAAYSQ/GefwBxkQBwQdv2lKX2kKDDs0Dq6atRp1ACLcBGAsYHQ/w651-h906/_DSC3874.jpg",
                "prepTime": "20",
                "cookingTime": "90",
                "serving": "6",
                "ingredients": "250 г. брашно\n30 г. фина захар\n40 г. студено масло\n1 яйце\n1 ч.л. натурално како на прах\n1 ч.л. прясно настъргана портокалова кора\n60 мл. вино Марсала200 г. Маскарпоне\n200 г. крема сирене\n150 мл. млечна сметана за разбиване\n4-5 с.л. подсладено кондензирано мляко\n1 с.л. прясно настъргана кора от портокал\n1 ч.л. ванилов екстракт\n500 мл. олио за пържене Hosso с чист и неутрален вкус\n1 белтък за намазване на тестото",
                "steps": "Смесете с пръсти студеното масло с пресятото брашно, какаото, захарта и портокаловите корички. Притискайте, докато получите смес наподобяваща трохи. Добавете яйцето и виното, омесете бързо, докато тестото се оформи на топка.\nОформете го във форма на диск и го завийте в найлоново стреч фолио. Приберете го в хладилника за 1 час.\nРазточете студеното тесто на тънка кора с дебелина 1,5-2 мм. Нарежете тестото с кръгла форма са сладки, с диаметър 8-10 см. Разточете всяко парче още малко.Поставете тестото върху цилиндрични форми за Каноли и залепете крайчетата с белтък.\nЗагрейте мазнината в съд за пържене до 170°С. Температурата не трябва да е прекалено висока, за да не прегорят Канолите. Изпържете до златисто-кафяво от всички страни и оставете цилиндрите да изстинат напълно преди да ги напълните с крем.\nЗа да приготвите крема, разбийте всички продукти с миксер на висока степен. Продуктите трябва да са студени. Поставете готовия крем в найлонов сладкарски пош и напълнете Канолите.\nЗа финал, поръсете върху крема с леко запечени и начупени ядки шам фъстък и лешници. Поръсете с пудра захар преди да сервирате.",
                "_createdOn": 1680788509024
            },
            "6987a937-a2d0-4a54-aecb-488734a16249": {
                "_ownerId": "555e7df7-a8b7-4391-b468-1a891f766202",
                "title": "Лимонови Чийзкейк барчета с малини и маслени трохи",
                "category": "Десерти",
                "imageUrl1": "https://donevatania.com/wp-content/uploads/2022/07/%D0%9B%D0%B8%D0%BC%D0%BE%D0%BD%D0%BE%D0%B2%D0%B8-%D0%A7%D0%B8%D0%B9%D0%B7%D0%BA%D0%B5%D0%B9%D0%BA-%D0%B1%D0%B0%D1%80%D1%87%D0%B5%D1%82%D0%B0-%D1%81-%D0%BC%D0%B0%D0%BB%D0%B8%D0%BD%D0%B8-%D0%B8-%D0%BC%D0%B0%D1%81%D0%BB%D0%B5%D0%BD%D0%B8-%D1%82%D1%80%D0%BE%D1%85%D0%B8-12.jpg",
                "imageUrl2": "https://donevatania.com/wp-content/uploads/2022/07/%D0%9B%D0%B8%D0%BC%D0%BE%D0%BD%D0%BE%D0%B2%D0%B8-%D0%A7%D0%B8%D0%B9%D0%B7%D0%BA%D0%B5%D0%B9%D0%BA-%D0%B1%D0%B0%D1%80%D1%87%D0%B5%D1%82%D0%B0-%D1%81-%D0%BC%D0%B0%D0%BB%D0%B8%D0%BD%D0%B8-%D0%B8-%D0%BC%D0%B0%D1%81%D0%BB%D0%B5%D0%BD%D0%B8-%D1%82%D1%80%D0%BE%D1%85%D0%B8-31.jpg",
                "prepTime": "45",
                "cookingTime": "35",
                "serving": "8",
                "ingredients": "230 г пълнозърнести бисквити\n30 г светло кафяза захар\n120 г разстопено масло\n½ ч. л. канела\nщипка сол\n125 г бяло брашно\n90 г пудра захар\n75 г разстопено масло\nщипка сол\n350 г крема сирене (стайнатемпература) Philadelphia Original\n80 г пудра захар\n1 бр. лимон (кората и сока)\n2 бр. големи яйца\n200 г пресни малини",
                "steps": "Загрейте фурната предварително до 175°C без вентилатор. Намажете леко с масло, квадратна форма с диаметър 20х20см. и постелете хартия за печене на дъното. (Най-добре е, ако формата е с подвижно дъно.)\nВ кухненски чопър, смелете бисквитите. Добавете кафявата захар, канелата и разтопеното масло, разбъркайте докато се смесят равномерно. Прехвърлете сместа в подготвената форма и я притиснете добре с лъжица, така че да се образува равномерен слой. Изпечете основата за чийзкейка за 7 до 8 минути, след което извадете от фурната и оставете настрана да се охлади.\nПресейте и смесете брашното, солта и захарта в малка купа. Постепенно добавете разтопеното масло, като разбърквате с вилица, докато сместа започне да се слепва и да образува едри трохи. Оставете настрани, докато приготвите останалите компоненти за чийзкейка.\nВ голяма купа, смесете крема сиренето, захарта, лимоновата кора и сока от лимона, разбийте с електрически миксер, докато сместа стане гладка. Добавете яйцата, едно по едно, като се уверите, че всяко е напълно абсорбирано, преди да добавите следващото. Изсипете крема върху кората и разпределете на равномерен слой. Отгоре подредете малините и ги покрийте с маслените трохи.\nПечете 30 до 35 минути, докато трохите по повърхността станат златни.\nИзвадете чийзкейка от фурната и го оставете да се охлади във формата, върху решетка до стайна температура. След това, приберете чийзкейка в хладилникада да се охлади напълно, поне за 4-5 часа преди сервиране.\nНарежете го на барчета и сервирайте.",
                "_createdOn": 1680788509024
            },
            "6557a937-a2d0-4a54-aecb-488734a16248": {
                "_ownerId": "555e7df7-a8b7-4391-b468-1a891f766202",
                "title": "Плетено хлебче с билки",
                "category": "Хляб",
                "imageUrl1": "http://2.bp.blogspot.com/-EqwayluZrEc/VlBwCi0XFEI/AAAAAAAAIzY/sXyqbyJaNUI/s1600/DSC_2367.JPG",
                "imageUrl2": "http://3.bp.blogspot.com/-f_O6ARKqd04/VlBwDaPcjcI/AAAAAAAAIzo/uoy1t8HyHQ4/s1600/DSC_2388.JPG",
                "prepTime": "20",
                "cookingTime": "25",
                "serving": "6",
                "ingredients": "20 грама прясна мая\n2 чаени лъжички захар\n150 милилитра хладка вода\n200 милилитра пълномаслено прясно мляко\n3 супени лъжици масло, разтопено и охладено\n2 яйца, единия жълтък служи за намазване на питката\n1 чаена лъжичка сол\n700 грама брашно\n4 стръка пресен босилек\n4 стръка прясна маточина\n1 супена лъжица сушена мащерка\n2 супени лъжици сусам\n2 супени лъжици масло\n2 супени лъжици зехтин\n1 скилидка чесън, много ситно нарязана\n1 щипка сол",
                "steps": "Намажете удобна тавичка за печене с масло и я оставете настрани, докато ви потрябва.\nВ малка купа, разтворете маята в хладката вода и добавете захарта. Разбъркайте и оставете за около 10 минути маята, докато се активира.\nВ голяма купа смесете брашното със солта и прибавете, млякото, яйцето и белтъка, маслото и маята, разбъркайте, докато получите гладка консистенция. Прехвърлете тестото на леко набрашнена повърхност. Замесете докато получите гладко и еластично тесто, което се оформя добре на топка и не лепне по ръцете ви.\nПоставете тестото в намазана с олио купа. Покрийте с кухненска кърпа и го оставете да втасва около един час.\nНаправете гладко песто от изброените продукти за плънката.\nВтасалото тесто поставете върху леко набрашнена повърхност и го разделете на две равни части. Разточете всяка част на правоъгълник с размери 20X40 сантиметра. Разделете приготвеното песто на две и намажете и двете части тесто равномерно. Навийте правоъгълниците на руло и ги разрежете на половина по дължина. Оплетете по този начин и поставете питката в предварително подготвената тавичка.\nВключете фурната на 190°С. Намажете питката с яйчния жълтък разбит с една супена лъжица прясно мляко. Печете питката до златисто кафяво, около 40 минути.",
                "_createdOn": 1680788509024
            },
            "8857a937-a2d0-4a54-aecb-488734a16248": {
                "_ownerId": "555e7df7-a8b7-4391-b468-1a891f766202",
                "title": "Супа с печено рагу от сьомга и зеленчуци",
                "category": "Супи",
                "imageUrl1": "https://donevatania.com/wp-content/uploads/2018/01/DSC_73-copy.jpg",
                "imageUrl2": "https://2.bp.blogspot.com/--iytAkh1t3o/WmyoZZVZEtI/AAAAAAAAOzY/S0p4uXMD0f4uS-leoQ5AbczNcg0LZ1tXgCLcBGAs/s1600/DSC_708.JPG",
                "prepTime": "20",
                "cookingTime": "45",
                "serving": "6",
                "ingredients": "700 грама рагу от сьомга\nсол и черен пипер за поръсване на месото преди печене\n1,5 литра вода\n500 милилитра домашен зеленчуков бульон\n3 супени лъжици зехтин Екстра Върджин\n1 средна глава жълт лук нарязан на кубчета\nглава целина нарязана на малки кубчета ½ чаена чаша\nстръкове целина нарязани на малки кубчета ½ чаена чаша\n3 средни моркова нарязани на кубчета\n1 зелена чушка нарязана на кубчета\n½ червена чушка нарязана на кубчета\n1 супена лъжица сух девисил\n2 средни картофа нарязани на кубчета",
                "steps": "Поставете хартия за печене върху голяма тава. Наредете рагуто и го овкусете със сол и черен пипер и от двете страни. Поставете тавата в фурна загрята на 190⁰С. Печете 30-35 минути. \nСложете на котлона в голяма тенджера водата, бульона, зехтина и нарязаните на кубчета зеленчуци. Подправете със сол и черен пипер. Варете на среден огън, докато картофите омекнат. Прибавете девисила. \nИзвадете рибата от фурната, оставете я да поизстине и премахнете всички кости и кожички, така че да остане само месото. Прибавете обезкостеното месо при зеленчуците в тенджерата и малко от мазнината, която си е пуснала рибата при печенето. \nВарете още около 10 минути супата и опитайте. Прибавете още малко сол и черен пипер, ако е необходимо. \nСервирайте супата гореща, подправена с лимонов сок.",
                "_createdOn": 1680788509024
            }
        }
    },
    "rules": {
        "users": {
            ".create": false,
            ".read": [
                "Owner"
            ],
            ".update": false,
            ".delete": false
        }
    }
}