{
    "identity": "email",
    "protectedData": {
        "users": {
            "35c62d76-8152-4626-8712-eeb96381bea8": {
                "email": "peter@abv.bg",
                "firstName": "Peter",
                "lastName": "Petrov",
                "hashedPassword": "83313014ed3e2391aa1332615d2f053cf5c1bfe05ca1cbcb5582443822df6eb1"
            },
            "555e7df7-a8b7-4391-b468-1a891f766202": {
                "email": "simona@gmail.bg",
                "firstName": "Симона",
                "lastName": "Иванова",
                "hashedPassword": "83313014ed3e2391aa1332615d2f053cf5c1bfe05ca1cbcb5582443822df6eb1"
            }
        },
        "sessions": {}
    },
    "seedData": {
        "recipes": {
            "7a58a937-a2d0-4a54-aecb-455704a1624f": {
                "_ownerId": "555e7df7-a8b7-4391-b468-1a891f766202",
                "title": "Празнична питка",
                "category": "Хляб",
                "imageUrl1": "https://3.bp.blogspot.com/-MxE3NmxKF6Q/Vtg32TkdbzI/AAAAAAAAJtI/hlIbjqp8t5w/s1600/DSC_4613.JPG",
                "imageUrl2": "https://2.bp.blogspot.com/-O9dpyj2FmUA/Vtg1ge9civI/AAAAAAAAJs8/UEXWiTH2BuI/s1600/DSC_4623.JPG",
                "prepTime": "20",
                "cookingTime": "60",
                "serving": "8",
                "ingredients": "260 милилитра прясно мляк\n7 грама суха мая\n2 супени лъжици захар\n80 грама масло, разтопено и охладено\n1 яйце и 1 белтък (жълтъка отделете за намазване на питката преди печене)\n1 чаена лъжичка прясно мляко за смесване с жълтъка 500 грама бяло брашно тип 650\n1 и ¼ чаени лъжички сол\nчерен и бял сусам за поръсване, по желание",
                "steps": "Намажете тава подходяща за печене с масло и я оставете настрана, докато ви потрябва.В малка купа смесете топлото мляко с 2 супени лъжици захар и 7 грама суха мая. Разбъркайте добре, докато маята се разтвори. Покрийте купата с кърпа и оставете сместа на топло място в продължение на 20 минути.\nРазтопете маслото и го оставете да се охлади. Разбйте яйцата с вилица. Прибавете охладеното масло и разбитите яйца към активираната мая, разбъркайте. Пресейте брашното и прибавете към него солта, разбъркайте и направете кладенче по средата. Изсипете в кладенчето смесените мляко, мая, масло и яйца. Разбъркайте всичко с дървена лъжица, докато се смеси добре.\nПоръсете плота с брашно и изсипете тестото. Омесете, докато получите меко, еластично и нелепнещо тесто.\nПоставете тестото в чиста купа и я покрийте с найлоново фолио. Оставете тестото да втасва за един час в топло помещение.\nСлед втасването на тестото го поставете върху поръсен с малко брашно плот, омесете за кратко и оформете питката, както ви харесва.\nОставете оформената питка да втасва за 40 минути.\nПреди да изпечете питката намажете повърхността с разбит жълтък с една чаена лъжичка прясно мляко.\nПоставете питката в студена фурна и включете на 200⁰С. Печете на тази температура 10 минути, след което намалете температурата на 180⁰С.\n",
                "_createdOn": 1680788509024
            },
            "7a58a937-a2d0-4a54-aecb-455704a16245": {
                "_ownerId": "555e7df7-a8b7-4391-b468-1a891f766202",
                "title": "Цветна салата с леща",
                "category": "Салати",
                "imageUrl1": "https://donevatania.com/wp-content/uploads/2021/03/DSC4560.jpg",
                "imageUrl2": "https://1.bp.blogspot.com/-6_hDG4fNjU0/YF21S3IdOXI/AAAAAAAAYXI/zg_2T_RxVU0gpZk2QRmerjjTwtCRu4d2ACLcBGAsYHQ/w649-h931/_DSC4570.jpg",
                "prepTime": "15",
                "cookingTime": "120",
                "serving": "4",
                "ingredients": "250 г. кафява леща, можете да използвате и Белуга\n2 портокала\n2 парчета цвекло предварително сварени\n1 нар\n100 г. меко козе сирене\n1 лук шалот\n1 връзка мента\n½ връзка магданоз",
                "steps": "Измийте цвеклото, завийте го в алуминиево фолио и го изпечете за 1 и ½ часа във фурната.\nИзмийте ментата и магданоза и ги оставете настрани да се отцедят.\nПоставете вода в касерола. След като заври, изсипете лещата в нея и варете за 20-25 минути на ниска температура, докато омекне, не прекалявайте с варенето. Изсипете в голяма цедка сварената леща, залейте със студена вода, за да спре варенето и отцедете много добре.\nСмесете сиренето със ситно нарязана мента и магданоз и оформете малки трюфели с ръце. Ако нямате меко козе сирене, можете да намачкате твърдо и да прибавите 1-2 чаени лъжички крема сирене, за да можете да оформите трюфелите. Оваляйте трюфелите в едро смлени ядки шам фъстък.\nМеждувременно обелете портокалите и ги нарежете на филийки (можете да замените портокалите с обикновени или да изпозвате пресни праскови или райска ябълка, според сезона, в който се намираме). Обелете и нарежете на филийки изпеченото цвекло и наронете зъната нар. Нарежете лука на полумесеци.\nЗа дресинга, нарежете чесъна на ситно и сложете всички съставки в ръчния чопър за смесване. С няколко движения ще получите най-съвършения дресинг.\nПодредете в голямо плато всички съставки за салатата и полейте с дресинга. Поръсете салатата със семената от нар и гарнирайте с прясна мента и трюфелите от козе сирене.\nСъс салатата можете да поднесете малки пуккави питки или препечени филийки, както предпочитате.\nЗа да приготвя моята салата, използвах тези два уреда, които също можете да намерите в каталога на Метро. Уверявам ви, че са абсолютно невероятни и имат място в кухнята на всяко домакинство! Аз съм влюбена в тях, защото се използват лесно, лесно се почистват и вършат прекрасно всичко, за което са предназначени. Например ръчния чопър за зеленчуци, използвам вече няколко пъти за смесване на дресинги, както и за разбиване на белтъци, а в нарязването е първенец само с няколко движения.",
                "_createdOn": 1680788509024
            },
            "7a58a937-a2d0-4a54-aecb-455704a16246": {
                "_ownerId": "555e7df7-a8b7-4391-b468-1a891f766202",
                "title": "Бутер кифлички със сладко от ягоди",
                "category": "Закуски",
                "imageUrl1": "https://donevatania.com/wp-content/uploads/2022/06/DSC40861.jpg",
                "imageUrl2": "https://donevatania.com/wp-content/uploads/2022/06/DSC409811.jpg",
                "prepTime": "10",
                "cookingTime": "30",
                "serving": "4",
                "ingredients": "сладко от ягоди\n1 бр. охладено бутер тесто\n8 ч. л. сладко от ягоди\n1 бр. жълтък + 1 ч. л. прясно мляко, за намазване на кифличките преди печене\nпудра запар за поръсване преди сервиране",
                "steps": "Включете фурната да загрява на 190°С.\nРазтворете бутер тестото върху работния плот.\nНарежете го на 8 квадрата. Разточете ги леко в правоъгълна форма върху леко набрашнена повърхност. Всяко парче, нарежете до половината на ленти по дължина. Поставете една чаена лъжичка от сладкото и го разпределете добре на другата половина от тестото. Навийте на руло откъм сладкото и оформете като кифличка.\nПоставете ги така оформените върху тава постлана с хартия за печене. Намажете кифличките с разбития жълтък с прясно мляко и печете за 30-35 минути, докато станат златисто-кафяви.\nПоръсете кифличките с пудра захар и ги сервирайте, докато са още топли.",
                "_createdOn": 1680788509024
            }
        }
    },
    "rules": {
        "users": {
            ".create": false,
            ".read": [
                "Owner"
            ],
            ".update": false,
            ".delete": false
        }
    }
}